10/data/attachments/461eee837f4b6d0f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6d553ce9-cb50-40df-a0db-649e302c6661</nif:username>
            <nif:friendToBeAdded>Yolanda_scientist_Friend_1377_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>